export const METRO_LINES = [
  {
    id: 'sok', color: '#EF161E', name: 'Сокольническая',
    stations: ['Бульвар Рокоссовского','Черкизовская','Преображенская площадь','Сокольники','Красносельская','Комсомольская','Красные Ворота','Чистые пруды','Лубянка','Охотный Ряд','Библиотека им. Ленина','Кропоткинская','Парк культуры','Фрунзенская','Спортивная','Воробьёвы горы','Университет','Проспект Вернадского','Юго-Западная','Тропарёво','Румянцево','Саларьево','Филатов Луг','Прокшино','Ольховая','Коммунарка']
  },
  {
    id: 'zam', color: '#2DBE2C', name: 'Замоскворецкая',
    stations: ['Речной вокзал','Водный стадион','Войковская','Сокол','Аэропорт','Динамо','Белорусская','Маяковская','Тверская','Театральная','Новокузнецкая','Павелецкая','Автозаводская','Технопарк','Коломенская','Каширская','Кантемировская','Царицыно','Орехово','Домодедовская','Красногвардейская']
  },
  {
    id: 'arb', color: '#2067A8', name: 'Арбатско-Покровская',
    stations: ['Щёлковская','Первомайская','Измайловская','Партизанская','Семёновская','Электрозаводская','Бауманская','Курская','Площадь Революции','Арбатская','Смоленская','Киевская','Парк Победы','Славянский бульвар','Кунцевская','Молодёжная','Крылатское','Строгино','Мякинино','Волоколамская','Митино','Пятницкое шоссе']
  },
  {
    id: 'fil', color: '#009EE0', name: 'Филёвская',
    stations: ['Сходненская','Тушинская','Спартак','Щукинская','Октябрьское Поле','Полежаевская','Беговая','Улица 1905 года','Краснопресненская','Киевская','Смоленская','Арбатская','Александровский сад','Выставочная','Международная']
  },
  {
    id: 'kol', color: '#894E35', name: 'Кольцевая',
    stations: ['Комсомольская','Курская','Таганская','Павелецкая','Добрынинская','Октябрьская','Парк культуры','Киевская','Краснопресненская','Белорусская','Новослободская','Проспект Мира']
  },
  {
    id: 'kzh', color: '#F07E24', name: 'Калужско-Рижская',
    stations: ['Медведково','Бабушкинская','Свиблово','Ботанический сад','ВДНХ','Алексеевская','Рижская','Проспект Мира','Сухаревская','Тургеневская','Китай-город','Третьяковская','Октябрьская','Шаболовская','Ленинский проспект','Академическая','Профсоюзная','Новые Черёмушки','Калужская','Беляево','Коньково','Тёплый Стан','Ясенево','Новоясеневская']
  },
  {
    id: 'tag', color: '#8D2990', name: 'Таганско-Краснопресненская',
    stations: ['Планерная','Сходненская','Тушинская','Спартак','Щукинская','Октябрьское Поле','Полежаевская','Беговая','Улица 1905 года','Баррикадная','Пушкинская','Кузнецкий мост','Китай-город','Таганская','Пролетарская','Волгоградский проспект','Текстильщики','Кузьминки','Рязанский проспект','Выхино','Лермонтовский проспект','Жулебино','Котельники']
  },
  {
    id: 'kal', color: '#FFD900', name: 'Калининская',
    stations: ['Третьяковская','Марксистская','Площадь Ильича','Авиамоторная','Шоссе Энтузиастов','Перово','Новогиреево','Новокосино']
  },
  {
    id: 'ser', color: '#A1A2A3', name: 'Серпуховско-Тимирязевская',
    stations: ['Алтуфьево','Бибирево','Отрадное','Владыкино','Петровско-Разумовская','Тимирязевская','Дмитровская','Савёловская','Менделеевская','Цветной бульвар','Чеховская','Боровицкая','Серпуховская','Тульская','Нагатинская','Нагорная','Нахимовский проспект','Варшавская','Каширская','Чертановская','Южная','Пражская','Улица Академика Янгеля','Аннино','Бульвар Дмитрия Донского']
  },
  {
    id: 'lub', color: '#B4D445', name: 'Люблинско-Дмитровская',
    stations: ['Селигерская','Верхние Лихоборы','Окружная','Петровско-Разумовская','Фонвизинская','Бутырская','Марьина Роща','Достоевская','Трубная','Сретенский бульвар','Чкаловская','Римская','Крестьянская застава','Дубровка','Кожуховская','Печатники','Волжская','Люблино','Братиславская','Марьино','Борисово','Шипиловская','Зябликово']
  },
  {
    id: 'bkl', color: '#0CACCA', name: 'Большая Кольцевая',
    stations: ['Савёловская','Рижская','Проспект Мира','Электрозаводская','Авиамоторная','Нижегородская','Текстильщики','Печатники','Угрешская','ЗИЛ','Автозаводская','Площадь Гагарина','Воронцовская','Новаторская','Аминьевская','Мичуринский проспект','Проспект Вернадского','Раменки','Кунцевская','Давыдково','Можайская','Народное Ополчение','Карамышевская','Хорошёво','Зорге','Панфиловская','Стрешнево','Балтийская','Коптево','Петровский парк','ЦСКА','Хорошёвская','Деловой центр']
  },
];

export type MetroLine = typeof METRO_LINES[0];
